#### Pandas 학습
![이미지](./images/ba001.png)
```python
!pip3 install pandas # Mac 기준
```
> 1. 라이브러리 추가
> 2. 자료구조 학습
>>   1. DataFrame
>>   2. Series

In [211]:
!pip3 install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/jaeyoung/Library/Python/3.12/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/jaeyoung/Library/Python/3.12/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

##### Pandas 라이브러리 로딩
```Python
import pandas
```

In [212]:
import pandas as pd

##### Pandas 기본 - DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일하다.
- 행(row)은 각 하나의 유니크한 데이터 묶음
- 열(column)은 유니크한 데이터의 하나하나의 특성

##### 딕셔너리로 DataFrame 객체 생성

In [213]:
data = {
    "이름": ["Cristiano", "Lionel", "Neymar"],
    "나이": [38, 35, 30],
    "결혼": [True, False, False],
}
df = pd.DataFrame(data=data)
df

          이름  나이     결혼
0  Cristiano  38   True
1     Lionel  35  False
2     Neymar  30  False

##### 2차원 리스트로 생성

In [214]:
data = [
    ["Ronaldo", 38, "Manchester", "cr7@naver.com", True],
    ["Messi", 35, "Barca", "lm10@naver.com", False],
    ["Sonny", 31, "London", "son7@naver.com", False],
    ["Naymar",32,'Pari','ney@naer.com',False]
]
data

[['Ronaldo', 38, 'Manchester', 'cr7@naver.com', True],
 ['Messi', 35, 'Barca', 'lm10@naver.com', False],
 ['Sonny', 31, 'London', 'son7@naver.com', False],
 ['Naymar', 32, 'Pari', 'ney@naer.com', False]]

##### 2차원 리스트로 DataFrame 객체 생성

In [215]:
df = pd.DataFrame(
    data=data, columns=["이름", "나이", "주소", "이메일", "결혼"]
)  # 데이터, 컬럼값(기본은 0,1,2,3,....)
df

        이름  나이          주소             이메일     결혼
0  Ronaldo  38  Manchester   cr7@naver.com   True
1    Messi  35       Barca  lm10@naver.com  False
2    Sonny  31      London  son7@naver.com  False
3   Naymar  32        Pari    ney@naer.com  False

##### DataFrame 에서 데이터 조회

In [216]:
df['이름']

0    Ronaldo
1      Messi
2      Sonny
3     Naymar
Name: 이름, dtype: object

##### DataFrame 열 조회

In [217]:
df[['이름','나이']]

        이름  나이
0  Ronaldo  38
1    Messi  35
2    Sonny  31
3   Naymar  32

##### DataFrame 행 조회

In [218]:
# 슬라이싱을 사용해도 된다.
df.loc[1:3]

       이름  나이      주소             이메일     결혼
1   Messi  35   Barca  lm10@naver.com  False
2   Sonny  31  London  son7@naver.com  False
3  Naymar  32    Pari    ney@naer.com  False

In [219]:
df

        이름  나이          주소             이메일     결혼
0  Ronaldo  38  Manchester   cr7@naver.com   True
1    Messi  35       Barca  lm10@naver.com  False
2    Sonny  31      London  son7@naver.com  False
3   Naymar  32        Pari    ney@naer.com  False

##### DataFrame 새 컬럼 추가

In [220]:
df['전화번호'] = ['7','10','0','1010']

##### DataFrame 열 삭제

In [221]:
df.drop("결혼", axis=1) 
# drop()은 지운상태로 출력만한다.
# axis = 0 은 행, axis=1 은 열

        이름  나이          주소             이메일  전화번호
0  Ronaldo  38  Manchester   cr7@naver.com     7
1    Messi  35       Barca  lm10@naver.com    10
2    Sonny  31      London  son7@naver.com     0
3   Naymar  32        Pari    ney@naer.com  1010

In [222]:
# drop() 을 삭제후 출력만 해주기 때문에 원본 데이터에 영향이 없다.
df

        이름  나이          주소             이메일     결혼  전화번호
0  Ronaldo  38  Manchester   cr7@naver.com   True     7
1    Messi  35       Barca  lm10@naver.com  False    10
2    Sonny  31      London  son7@naver.com  False     0
3   Naymar  32        Pari    ney@naer.com  False  1010

In [223]:
# 완벽한 삭제를 할려면 inplace 옵션을 사용해야 한다.
df.drop('결혼', axis=1,inplace=True)

In [224]:
df

        이름  나이          주소             이메일  전화번호
0  Ronaldo  38  Manchester   cr7@naver.com     7
1    Messi  35       Barca  lm10@naver.com    10
2    Sonny  31      London  son7@naver.com     0
3   Naymar  32        Pari    ney@naer.com  1010

##### DataFrame 행 추가 및 삭제

In [225]:
# 행 추가
df.loc[4] = ['Kane',30,'London','Kana10@naver.com','010']

In [226]:
df

        이름  나이          주소               이메일  전화번호
0  Ronaldo  38  Manchester     cr7@naver.com     7
1    Messi  35       Barca    lm10@naver.com    10
2    Sonny  31      London    son7@naver.com     0
3   Naymar  32        Pari      ney@naer.com  1010
4     Kane  30      London  Kana10@naver.com   010

In [227]:
# 삭제는 inplace 옵션을 쓰거나 새로운 변수에 재할당 하면된다.
df2 = df.drop(2)

In [228]:
df.drop(2, axis=0, inplace=True)

In [229]:
df

        이름  나이          주소               이메일  전화번호
0  Ronaldo  38  Manchester     cr7@naver.com     7
1    Messi  35       Barca    lm10@naver.com    10
3   Naymar  32        Pari      ney@naer.com  1010
4     Kane  30      London  Kana10@naver.com   010

##### DataFrame 열 이름을 변경

In [230]:
df.rename(
    columns={"전화번호": "폰번호"},inplace=True
)

In [231]:
df

        이름  나이          주소               이메일   폰번호
0  Ronaldo  38  Manchester     cr7@naver.com     7
1    Messi  35       Barca    lm10@naver.com    10
3   Naymar  32        Pari      ney@naer.com  1010
4     Kane  30      London  Kana10@naver.com   010

#### 시리즈 객체
- Python 에서 1차원 리스트(배열)과 같지만 기능은 시리즈가 더 많다.
- 시리즈들 그루핑한게 데이터프레임
- 가장 최소단위

In [232]:
data = [47, 20, 40, 18, 32]
srs = pd.Series(data=data)
srs

0    47
1    20
2    40
3    18
4    32
dtype: int64

##### DataFrame 의 한 열은 시리즈와 동일하다

In [233]:
type(df['나이'])

pandas.core.series.Series

In [234]:
type(srs)

pandas.core.series.Series

In [235]:
srs = pd.Series(data=data, index=['박지성','차범근', '기성용', '홍명보','손흥민'])
srs

박지성    47
차범근    20
기성용    40
홍명보    18
손흥민    32
dtype: int64

In [236]:
# 조회는 인덱스명으로 접근한다.
srs['손흥민']

32

In [237]:
# 값 변경도 일반 인덱스와 같다.
srs['차범근'] = 100

In [238]:
srs

박지성     47
차범근    100
기성용     40
홍명보     18
손흥민     32
dtype: int64

In [239]:
# 데이터프레임에서 한 행을 가져와도 시리즈
print(type(df.loc[1]))

<class 'pandas.core.series.Series'>

##### DataFrame 사용하기
- CSV, EXCEL 파일 로드
- VS Code 플로그인 : Excel Viewer(Grapecity)

###### Openpyxl 을 설치해야 엑셀파일이 로드된다.

In [240]:
!pip3 install openpyxl

Requirement already satisfied: openpyxl in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [241]:
# 원본(윈도우에서 cp949로 저장되서 cp949로 인코딩해야함)
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8')
df_csv

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2  Unnamed: 3
0            국적코드         성별       입국객수         NaN
1             A01         남성     106320         NaN
2             A01         여성     191436         NaN
3             A31         남성        319         NaN
4             A31         여성         42         NaN
5             A18         남성     158912         NaN
6             A18         여성     232943         NaN
7           총 합계      689972        NaN         NaN
8            전년동기     499361        NaN         NaN

In [242]:
# header 제목행 지정
# skipfooter 밑행을 지우기
df_csv = pd.read_csv("./data/sample_1.csv", encoding="utf-8", header=1, skipfooter=2)
df_csv

/var/folders/pq/25bzgj695sx38jrw0bp84jdw0000gn/T/ipykernel_80175/571367045.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df_csv = pd.read_csv("./data/sample_1.csv", encoding="utf-8", header=1, skipfooter=2)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [243]:
df_xls = pd.read_excel('./data/sample_1.xlsx')
df_xls

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241
3             A31         남성        319        299
4             A31         여성         42         54
5             A18         남성     158912     124486
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN

In [244]:
# df_xls = pd.read_excel('./data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C', sheet_name='Sheet1')
df_xls = pd.read_excel('./data/sample_1.xlsx',header=1,skipfooter=2,usecols='A:C', sheet_name='Sheet1')

df_xls

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [245]:
print(type(df_csv))
print(type(df_xls))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [246]:
# DataFrame 정보확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [247]:
# 위에서부터 데이터 일부 보기(5개가 기본)
df_csv.head(n = 3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [248]:
# 아래부터 데이터 일부 보기
df_csv.tail(n=3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [249]:
# 통계량 요약보기
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [250]:
df_csv

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [251]:
df_csv["기준년월"] = ["2023-01", "2023-02", "2023-03", "2023-04", "2023-05", "2023-06"]
df_csv["기준년월"] = ["2023-10", "2023-11", "2023-12", "2024-01", "2024-02", "2024-03"]

In [252]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12
3  A31  여성      42  2024-01
4  A18  남성  158912  2024-02
5  A18  여성  232943  2024-03

In [253]:
# 하나의 데이터를 통일시킬 때
df_csv['기준년월']='1997-03'

In [254]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  1997-03
1  A01  여성  191436  1997-03
2  A31  남성     319  1997-03
3  A31  여성      42  1997-03
4  A18  남성  158912  1997-03
5  A18  여성  232943  1997-03

In [255]:
df_csv.loc[0:2]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  1997-03
1  A01  여성  191436  1997-03
2  A31  남성     319  1997-03

##### DataFrame 필터링

In [256]:
# 필터링
condition = (df_csv['국적코드'] == 'A31')
condition

0    False
1    False
2     True
3     True
4    False
5    False
Name: 국적코드, dtype: bool

In [257]:
df_csv[condition]

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  1997-03
3  A31  여성    42  1997-03

In [258]:
df_csv[df_csv['성별']=='여성']

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  1997-03
3  A31  여성      42  1997-03
5  A18  여성  232943  1997-03

In [259]:
# 입국객수가 20만 이상인거
df_csv[df_csv['입국객수']>=200_000]

  국적코드  성별    입국객수     기준년월
5  A18  여성  232943  1997-03

In [260]:
# 다중조건 필터링
df_csv[(df_csv['입국객수']>=100_000) & (df_csv['성별']=='남성')]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  1997-03
4  A18  남성  158912  1997-03

In [261]:
# 한 열에 여러값으로 필터링
df_csv[df_csv['국적코드'].isin(['A01', 'A31'])]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  1997-03
1  A01  여성  191436  1997-03
2  A31  남성     319  1997-03
3  A31  여성      42  1997-03

In [262]:
df_csv[df_csv['국적코드'].isin(['A01', 'A31'])==False]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  1997-03
5  A18  여성  232943  1997-03

In [263]:
df_csv['국적명'] = ['일본','일본','괌','괌','중국','중국']
df_csv

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  1997-03  일본
1  A01  여성  191436  1997-03  일본
2  A31  남성     319  1997-03   괌
3  A31  여성      42  1997-03   괌
4  A18  남성  158912  1997-03  중국
5  A18  여성  232943  1997-03  중국

In [264]:
df_csv = df_csv.set_index(keys='국적명')

In [265]:
df_csv

    국적코드  성별    입국객수     기준년월
국적명
일본   A01  남성  106320  1997-03
일본   A01  여성  191436  1997-03
괌    A31  남성     319  1997-03
괌    A31  여성      42  1997-03
중국   A18  남성  158912  1997-03
중국   A18  여성  232943  1997-03

In [266]:
df_csv = df_csv.reset_index()

In [267]:
df_csv

  국적명 국적코드  성별    입국객수     기준년월
0  일본  A01  남성  106320  1997-03
1  일본  A01  여성  191436  1997-03
2   괌  A31  남성     319  1997-03
3   괌  A31  여성      42  1997-03
4  중국  A18  남성  158912  1997-03
5  중국  A18  여성  232943  1997-03

In [268]:
# 그룹화(Grouping) : groupby() 함수만으로 사용못한다.
# 여러 함수를 같이 사용해야 DF로 출력됨.
df_csv.groupby('국적명').count()

     국적코드  성별  입국객수  기준년월
국적명
괌       2   2     2     2
일본      2   2     2     2
중국      2   2     2     2

In [269]:
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [270]:
df_csv

  국적명 국적코드  성별    입국객수     기준년월
0  일본  A01  남성  106320  1997-03
1  일본  A01  여성  191436  1997-03
2   괌  A31  남성     319  1997-03
3   괌  A31  여성      42  1997-03
4  중국  A18  남성  158912  1997-03
5  중국  A18  여성  232943  1997-03

In [271]:
# DataFrame 에서 Dtype 이 int나 float 같은 슃형만 통계내는 의미가 있음.
df_csv.groupby('국적명').sum('입국객수')

       입국객수
국적명
괌       361
일본   297756
중국   391855

In [272]:
# 그룹 후 통계함수 사용시 동일하게 적용
# mdeian() 중앙값, min() , max(), std() 표준편차, var() 분산
df_csv.groupby('국적명').min('입국객수')

       입국객수
국적명
괌        42
일본   106320
중국   158912

In [273]:
# 정렬 (오름차순은 asencding 옵션추가)
df_csv.sort_values('입국객수')

  국적명 국적코드  성별    입국객수     기준년월
3   괌  A31  여성      42  1997-03
2   괌  A31  남성     319  1997-03
0  일본  A01  남성  106320  1997-03
4  중국  A18  남성  158912  1997-03
1  일본  A01  여성  191436  1997-03
5  중국  A18  여성  232943  1997-03

In [275]:
df_csv.sort_values('입국객수',ascending=False)

  국적명 국적코드  성별    입국객수     기준년월
5  중국  A18  여성  232943  1997-03
1  일본  A01  여성  191436  1997-03
4  중국  A18  남성  158912  1997-03
0  일본  A01  남성  106320  1997-03
2   괌  A31  남성     319  1997-03
3   괌  A31  여성      42  1997-03